[
  {
    "year": 2025,
    "citation": "1.\tJ. Zhang, J. Peng, D. Hu, M.F. Gelin, and Z. Lan, What Two-Dimensional Electronic Spectroscopy Can Tell Us about Energy Transfer in Dendrimers: Ab Initio Simulations. J. Phys. Chem. Lett., 2025, 16, 1007–1015.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2025,
    "citation": "J. Zhang, D. Hu, J. Peng, M.F. Gelin, and Z. Lan, Photolysis of Methyl Nitrate (CH3ONO2) Through the Prism of Ab initio Simulations of Transient-Absorption Pump-Probe Spectra. J. Chem. Phys., 2025, 162, 224302.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2025,
    "citation": "L. Yang, J. Huang, Y. Liao, D. Hu, Y. He, N. Feng, R.T.K. Kwok, J.W.Y. Lam, J. Zhang, B. He, and B.Z. Tang, Strategically Designed Mitochondria-Targeting AIEgens for Effective Eradication of Primary and Metastatic Tumors via Synergistic Phototherapy and Induced Immunogenic Cell Death. Adv. Healthcare Mater., 2025, 14, 2500513.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2025,
    "citation": "B.M. Weight, A. Mandal, D. Hu, and P. Huo, Ab Initio Spin-mapping Non-Adiabatic Dynamics Simulations of Photochemistry. J. Chem. Phys., 2025, 162, 084105.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2025,
    "citation": "J. Wang, D. Hu, and Y.-J. Liu, Theoretical Regulation of Firefly Bioluminescence Spectra: Exploring New Frontiers in Nir-Ii Imaging. J. Photochem. Photobiol. A, 2025, 466, 116393.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2025,
    "citation": "S. Pi, Y. Luo, D. Hu, and Y.-J. Liu, First Theoretical Evidence of Blue-Shifted Energy Transfer in Bioluminescence. Commun. Comput. Chem., 2025, 1, 61–70.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2025,
    "citation": "S. Pi, D. Hu, and Y.-J. Liu, Mechanistic Investigation of Green Fluorescent Protein Acquiring Energy for Emitting Light: A Theoretical Study. J. Phys. Chem. B, 2025, 129, 2925–2933.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2025,
    "citation": "H. Huang, J. Zhang, D. Hu, and Y.-J. Liu, Nonadiabatic Dynamics of the Molecular Tully Models with the Mixed-Reference Spin-Flip Time-Dependent Density Functional Theory. J. Phys. Chem. Lett., 2025, 16, 13038–13045.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2025,
    "citation": "H. Huang, J. Peng, Z. Lan, D. Hu, and Y.-J. Liu, Nonadiabatic Dynamics of Intersystem Crossings with the Symmetrical Quasi-Classical Dynamics Method Based on the Meyer–Miller Mapping Hamiltonian. J. Chem. Theory Comput., 2025, 21, 4386–4396.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2025,
    "citation": "D. Hu, B.X.K. Chng, W. Ying, and P. Huo, Trajectory-Based Non-Adiabatic Simulations of the Polariton Relaxation Dynamics. J. Chem. Phys., 2025, 162, 124113.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2024,
    "citation": "X. Pang, K. Zhao, D. Hu, Q. Zhong, N. Zhang, and C. Jiang, Effect of Load-resisting Force on Photoisomerization Mechanism of a Single Second Generation Light-Driven Molecular Rotary Motor. J. Chem. Phys., 2024, 161, 164302.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2023,
    "citation": "J. Zhang, J. Peng, Y. Zhu, D. Hu, and Z. Lan, Influence of Mode-Specific Excitation on the Nonadiabatic Dynamics of Methyl Nitrate (CH3ONO2). J. Phys. Chem. Lett., 2023, 14, 6542–6549.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2023,
    "citation": "J. Peng, D. Hu, H. Liu, Q. Shi, P. Bao, and Z. Lan, Studies of Nonadiabatic Dynamics in the Singlet Fission Processes of Pentacene Dimer via Tensor Network Method. J. Chem. Phys., 2023, 159, 224301.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2023,
    "citation": "D. Hu, W. Ying, and P. Huo, Resonance Enhancement of Vibrational Polariton Chemistry Obtained from the Mixed Quantum-Classical Dynamics Simulations. J. Phys. Chem. Lett., 2023, 14, 11208–11216.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2023,
    "citation": "D. Hu and P. Huo, Ab Initio Molecular Cavity Quantum Electrodynamics Simulations Using Machine Learning Models. J. Chem. Theory Comput., 2023, 19, 2353–2368.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2022,
    "citation": "W. Zhou, D. Hu, A. Mandal, and P. Huo, Nuclear Gradient Expressions for Molecular Cavity Quantum Electrodynamics Simulations Using Mixed Quantum-Classical Methods. J. Chem. Phys., 2022, 157, 104118.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2022,
    "citation": "J. zhang, J. Peng, D. Hu, C. Xu, and Z. Lan, Understanding Photolysis of CH3ONO2 with On-the-Fly Nonadiabatic Dynamics Simulation at the ADC(2) Level. Chinese J. Chem. Phys., 2022, 35, 451–460.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2022,
    "citation": "C. Xu, K. Lin, D. Hu, F.L. Gu, M.F. Gelin, and Z. Lan, Ultrafast Internal Conversion Dynamics through the on-the-Fly Simulation of Transient Absorption Pump-Probe Spectra with Different Electronic Structure Methods. J. Phys. Chem. Lett., 2022, 13, 661–668.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2022,
    "citation": "Q. Sun, Y. Wu, Y. Cui, C. Gao, D. Hu, Q. Ou, L. Wang, Y. Wang, J. Zhao, H. Dong, C. Zhang, Q. Peng, Z. Shuai, and H. Fu, Molecular Design of DBA-Type Five-Membered Heterocyclic Rings to Achieve 200% Exciton Utilization for Electroluminescence. Mater. Horiz., 2022, 9, 2518–2523.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2022,
    "citation": "Y. Jiang, Y. Shi, D. Hu, Q. Peng, G. Huang, and B.S. Li, Insight into Isomeric Effect on the Photoluminescence and Mechanoluminescence of Cyanostilbene Derivatives. J. Phys. Chem. Lett., 2022, 13, 7681–7688.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2022,
    "citation": "D. Hu, A. Mandal, B.M. Weight, and P. Huo, Quasi-diabatic Propagation Scheme for Simulating Polariton Chemistry. J. Chem. Phys., 2022, 157, 194109.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2021,
    "citation": "Y. Zhang, D. Zhang, T. Huang, A. Gillett, Y. Liu, D. Hu, L. Cui, Z. Bin, G. Li, J. Wei, and L. Duan, Multi-Resonance Deep-Red Emitters with ShallowPotential-Energy Surfaces to Surpass Energy-Gap Law. Angew. Chem. Int. Edit., 2021, 60, 20498–20503.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2021,
    "citation": "J. Zhang, J. Peng, D. Hu, and Z. Lan, Investigation of Nonadiabatic Dynamics in the Photolysis of Methyl Nitrate (CH3ONO2) by on-the-Fly Surface Hopping Simulation. Phys. Chem. Chem. Phys., 2021, 23, 25597–25611.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2021,
    "citation": "S. Wang, D. Hu, X. Guan, S. Cai, G. Shi, Z. Shuai, J. Zhang, Q. Peng, and X. Wan, Brightening up Circularly Polarized Luminescence of Monosubstituted Polyacetylene by Conformation Control: Mechanism, Switching, and Sensing. Angew. Chem. Int. Edit., 2021, 60, 21918–21926.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2021,
    "citation": "K. Qin, W. Gong, J. Gao, D. Hu, H. Shi, W. Yao, Z. An, and H. Ma, Theoretical Insight Into the Ultralong Room-Temperature Phosphorescence of Nonplanar Aromatic Hydrocarbon. Front. Chem., 2021, 9, 740018.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2021,
    "citation": "J. Peng, Y. Xie, D. Hu, and Z. Lan, Analysis of Bath Motion in MM-SQC Dynamics via Dimensionality Reduction Approach: Principal Component Analysis. J. Chem. Phys., 2021, 154, 094122.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2021,
    "citation": "K. Lin, D. Hu, J. Peng, C. Xu, F.L. Gu, and Z. Lan, Prediction of the Excited-State Reaction Channels in Photo-Induced Processes of Nitrofurantoin Using First-Principle Calculations and Dynamics Simulations. Chemosphere, 2021, 281, 130831.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2021,
    "citation": "N. Liang, G. Liu, D. Hu, K. Wang, Y. Li, T. Zhai, X. Zhang, Z. Shuai, H. Yan, J. Hou, and Z. Wang, Heavy-Atom-Free Room-Temperature Phosphorescent Rylene Imide for High-Performing Organic Photovoltaics. Adv. Sci., 2021, 9, 2103975.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2021,
    "citation": "D. Hu, Y. Xie, J. Peng, and Z. Lan, On-the-Fly Symmetrical Quasi-Classical Dynamics with Meyer-Miller Mapping Hamiltonian for the Treatment of Nonadiabatic Dynamics at Conical Intersections. J. Chem. Theory Comput., 2021, 17, 3267–3279.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2021,
    "citation": "D. Hu, J. Peng, L. Chen, M.F. Gelin, and Z. Lan, Spectral Fingerprint of Excited-State Energy Transfer in Dendrimers through Polarization-Sensitive Transient-Absorption Pump-Probe Signals: On-the-Fly Nonadiabatic Dynamics Simulations. J. Phys. Chem. Lett., 2021, 12, 9710–9719.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2020,
    "citation": "Y. Zhang, D. Zhang, J. Wei, X. Hong, Y. Lu, D. Hu, G. Li, Z. Liu, Y. Chen, and L. Duan, Achieving Pure Green Electroluminescence with CIEy of 0.69 and EQE of 28.2% from an Aza-Fused Multi-Resonance Emitter. Angew. Chem. Int. Edit., 2020, 59, 17499–17503.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2019,
    "citation": "J. Peng, Y. Xie, D. Hu, and Z. Lan, Performance of Trajectory Surface Hopping Method in the Treatment of Ultrafast Intersystem Crossing Dynamics. J. Chem. Phys., 2019, 150, 164126.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2019,
    "citation": "J. Peng, Y. Xie, D. Hu, L. Du, and Z. Lan, Treatment of Nonadiabatic Dynamics by on-the-Fly Trajectory Surface Hopping Dynamics. Acta Phys.-Chim. Sin., 2019, 35, 28–48.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2018,
    "citation": "X. Pang, C. Jiang, Y. Qi, L. Yuan, D. Hu, X. Zhang, D. Zhao, D. Wang, Z. Lan, and F. Li, Ultrafast Unidirectional Chiral Rotation in the Z-E Photoisomerization of Two Azoheteroarene Photoswitches. Phys. Chem. Chem. Phys., 2018, 20, 25910–25917.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2018,
    "citation": "X. Li, D. Hu, Y. Xie, and Z. Lan, Analysis of Trajectory Similarity and Configuration Similarity in on-the-Fly Surface-Hopping Simulation on Multi-Channel Nonadiabatic Photoisomerization Dynamics. J. Chem. Phys., 2018, 149, 244104.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2018,
    "citation": "D. Hu, Y. Xie, X. Li, L. Li, and Z. Lan, Inclusion of Machine Learning Kernel Ridge Regression Potential Energy Surfaces in on-the-Fly Nonadiabatic Molecular Dynamics Simulation. J. Phys. Chem. Lett., 2018, 9, 2725–2732.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2017,
    "citation": "X. Pang, X. Cui, D. Hu, C. Jiang, D. Zhao, Z. Lan, and F. Li, \"Watching\" the Dark State in Ultrafast Nonadiabatic Photoisomerization Process of A Light-Driven Molecular Rotary Motor. J. Phys. Chem. A, 2017, 121, 1240–1249.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2017,
    "citation": "X. Li, Y. Xie, D. Hu, and Z. Lan, Analysis of the Geometrical Evolution in on-the-Fly Surface-Hopping Nonadiabatic Dynamics with Machine Learning Dimensionality Reduction Approaches: Classical Multidimensional Scaling and Isometric Feature Mapping. J. Chem. Theory Comput., 2017, 13, 4611–4623.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2017,
    "citation": "D. Hu, Y.F. Liu, A.L. Sobolewski, and Z. Lan, Nonadiabatic Dynamics Simulation of Keto Isocytosine: A Comparison of Dynamical Performance of Different Electronic-Structure Methods. Phys. Chem. Chem. Phys., 2017, 19, 19168–19177.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2017,
    "citation": "W. Gan, W. Wu, F. Yang, D. Hu, H. Fang, Z. Lan, and Q. Yuan, The Behavior of Hydroxide and Hydronium Ions at the Hexadecane-Water Interface Studied with Second Harmonic Generation and Zeta Potential Measurements. Soft Matter, 2017, 13, 7962–7968.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2015,
    "citation": "Y.F. Liu, J. Guan, D. Hu, L. Du, H. Sun, J. Gao, J. Zhao, and Z. Lan, Computational Investigation of Acene-Modified Zinc-Porphyrin Based Sensitizers for Dye-Sensitized Solar Cells. J. Phys. Chem. C, 2015, 119, 8417–8430.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2015,
    "citation": "J. Huang, L. Du, D. Hu, and Z. Lan, Theoretical Analysis of Excited States and Energy Transfer Mechanism in Conjugated Dendrimers. J. Comput. Chem., 2015, 36, 151–163.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2015,
    "citation": "P. Hu, Y. Duan, D. Hu, B. Qin, J. Zhang, Q. Wang, Z. Liu, G. Cui, and L. Chen, Rigid-Flexible Coupling High Ionic Conductivity Polymer Electrolyte for an Enhanced Performance of LiMn2O4/Graphite Battery at Elevated Temperature. Acs Appl. Mater. Inter., 2015, 7, 4720–4727.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2015,
    "citation": "D. Hu, Y. Xie, J. Huang, L. Du, J. Zheng, and Z. Lan, Theoretical Studies on Nonadiabatic Process in Chemical Dynamics. Sci. Sin. Chim., 2015, 45, 777–799.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2015,
    "citation": "D. Hu, J. Huang, Y. Xie, L. Yue, X. Zhuang, and Z. Lan, Nonadiabatic Dynamics and Photoisomerization of Biomimetic Photoswitches. Chem. Phys., 2015, 463, 95–105.",
    "pdf": "",
    "url": ""
  },
  {
    "year": 2015,
    "citation": "Z. Cong, W. Li, D. Hu, Z. Lan, and B. Hou, Study of Adsorption Behavior and Inhibition Mechanism of Mild Steel in Hydrochloric Acid by a Novel Thiadiazole Derivative. Electrochemistry, 2015, 83, 262–267.",
    "pdf": "",
    "url": ""
  }
]